///*
//	2차원 배열 - 초기화
//*/
//
//int main()
//{
//	int ary[4] = { 1, 2, 3, 4 };		
//			
//	int ary2[3][2] = { {1, 2}, {3, 4}, {5, 6} };				// 2차원 배열
//	int ary3[3][4] = { {1, 2}, {3, 4, 5}, {6, 7, 8, 9} };		// 공백에 0으로 채움
//	int ary4[3][2] = { 1, 2, 3, 4, 5, 6 };
//	int ary5[][4] = { {1, 2, 3, 4}, {5, 6, 7, 8} };				// 생략가능
//
//	for (int i = 0; i < 3; i++) {
//		for (int j = 0; j < 2; j++) {
//			if (i == 2 && j == 1) {
//				printf("%d", ary2[i][j]);
//			}
//			else printf("%d, ", ary2[i][j]);
//		}
//	}
//
//	return 0;
//}